In [1]:
%load_ext sql

In [2]:
%reload_ext sql

In [3]:
%sql sqlite://

In [4]:
%%sql
CREATE TABLE Worker (
WORKER_ID INT,
FIRST_NAME CHAR(25),
LAST_NAME CHAR(25),
SALARY INT(15),
JOINING_DATE DATETIME,
DEPARTMENT CHAR(25)
);

 * sqlite://
Done.

[]

In [9]:
%%sql
INSERT INTO Worker VALUES(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR');
INSERT INTO Worker VALUES(2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin');
INSERT INTO Worker VALUES(3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR');
INSERT INTO Worker VALUES(4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin');
INSERT INTO Worker VALUES(5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin');
INSERT INTO Worker VALUES(6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account');
INSERT INTO Worker VALUES(7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account');
INSERT INTO Worker VALUES(8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

#### Q-1. Write an SQL query to print the FIRST_NAME from Worker table after removing white spaces from the right side.

In [10]:
%%sql
select RTRIM(First_name) from worker

 * sqlite://
Done.

[('Monika',),
 ('Niharika',),
 ('Vishal',),
 ('Amitabh',),
 ('Vivek',),
 ('Vipul',),
 ('Satish',),
 ('Geetika',)]

#### Q-2. Write an SQL query that fetches the unique values of DEPARTMENT from Worker table and prints its length.

In [15]:
%%sql
select distinct(department) from worker where length(department)

 * sqlite://
Done.

[('HR',), ('Admin',), ('Account',)]

#### Q-3. Write an SQL query to fetch nth max salaries from a table.

In [16]:
%%sql
select max(salary) from worker

 * sqlite://
Done.

[(500000,)]